apache/nuttx/arch/arm/src/common/stm32/stm32_tim_clk.h
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_tim_clk.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_STM32_TIM_CLK_H
#define __ARCH_ARM_SRC_COMMON_STM32_STM32_TIM_CLK_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "stm32.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Per-family RCC clock-enable and reset aliases for the common timer
 * drivers.  Only the timer RCC enable/reset register and bit differ between
 * families; the timer input clock is provided uniformly by each board as
 * STM32_TIMn_CLKIN.
 */

#if defined(CONFIG_ARCH_CHIP_STM32H7)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM2_EN      RCC_APB1LENR_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM2_RST     RCC_APB1LRSTR_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM3_EN      RCC_APB1LENR_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM3_RST     RCC_APB1LRSTR_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM4_EN      RCC_APB1LENR_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM4_RST     RCC_APB1LRSTR_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM5_EN      RCC_APB1LENR_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM5_RST     RCC_APB1LRSTR_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM6_EN      RCC_APB1LENR_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM6_RST     RCC_APB1LRSTR_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM7_EN      RCC_APB1LENR_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM7_RST     RCC_APB1LRSTR_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM12_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM12_EN     RCC_APB1LENR_TIM12EN
#  define STM32_RCC_TIM12_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM12_RST    RCC_APB1LRSTR_TIM12RST
#  define STM32_RCC_TIM13_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM13_EN     RCC_APB1LENR_TIM13EN
#  define STM32_RCC_TIM13_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM13_RST    RCC_APB1LRSTR_TIM13RST
#  define STM32_RCC_TIM14_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM14_EN     RCC_APB1LENR_TIM14EN
#  define STM32_RCC_TIM14_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM14_RST    RCC_APB1LRSTR_TIM14RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32F7)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM9_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM9_EN      RCC_APB2ENR_TIM9EN
#  define STM32_RCC_TIM9_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM9_RST     RCC_APB2RSTR_TIM9RST
#  define STM32_RCC_TIM10_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM10_EN     RCC_APB2ENR_TIM10EN
#  define STM32_RCC_TIM10_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM10_RST    RCC_APB2RSTR_TIM10RST
#  define STM32_RCC_TIM11_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM11_EN     RCC_APB2ENR_TIM11EN
#  define STM32_RCC_TIM11_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM11_RST    RCC_APB2RSTR_TIM11RST
#  define STM32_RCC_TIM12_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM12_EN     RCC_APB1ENR_TIM12EN
#  define STM32_RCC_TIM12_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM12_RST    RCC_APB1RSTR_TIM12RST
#  define STM32_RCC_TIM13_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM13_EN     RCC_APB1ENR_TIM13EN
#  define STM32_RCC_TIM13_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM13_RST    RCC_APB1RSTR_TIM13RST
#  define STM32_RCC_TIM14_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM14_EN     RCC_APB1ENR_TIM14EN
#  define STM32_RCC_TIM14_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM14_RST    RCC_APB1RSTR_TIM14RST
#elif defined(CONFIG_ARCH_CHIP_STM32H5)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM2_EN      RCC_APB1LENR_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM2_RST     RCC_APB1LRSTR_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM3_EN      RCC_APB1LENR_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM3_RST     RCC_APB1LRSTR_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM4_EN      RCC_APB1LENR_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM4_RST     RCC_APB1LRSTR_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM5_EN      RCC_APB1LENR_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM5_RST     RCC_APB1LRSTR_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM6_EN      RCC_APB1LENR_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM6_RST     RCC_APB1LRSTR_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1LENR
#  define STM32_RCC_TIM7_EN      RCC_APB1LENR_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM7_RST     RCC_APB1LRSTR_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM12_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM12_EN     RCC_APB1LENR_TIM12EN
#  define STM32_RCC_TIM12_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM12_RST    RCC_APB1LRSTR_TIM12RST
#  define STM32_RCC_TIM13_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM13_EN     RCC_APB1LENR_TIM13EN
#  define STM32_RCC_TIM13_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM13_RST    RCC_APB1LRSTR_TIM13RST
#  define STM32_RCC_TIM14_EN_REG STM32_RCC_APB1LENR
#  define STM32_RCC_TIM14_EN     RCC_APB1LENR_TIM14EN
#  define STM32_RCC_TIM14_RST_REG STM32_RCC_APB1LRSTR
#  define STM32_RCC_TIM14_RST    RCC_APB1LRSTR_TIM14RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32U5)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR1_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR1_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR1_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR1_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR1_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR1_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR1_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR1_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR1_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR1_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR1_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR1_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32L5)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR1_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR1_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR1_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR1_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR1_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR1_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR1_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR1_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR1_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR1_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR1_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR1_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32WL5)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR1_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR1_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR1_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR1_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR1_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR1_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR1_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR1_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR1_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR1_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR1_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR1_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32L4)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR1_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR1_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR1_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR1_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR1_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR1_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR1_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR1_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR1_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR1_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR1_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR1_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#elif defined(CONFIG_ARCH_CHIP_STM32WB)
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR1
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR1_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR1
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR1_TIM2RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#else  /* Classic M3/M4 + M0: APB1ENR/APB2ENR */
#  define STM32_RCC_TIM1_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM1_EN      RCC_APB2ENR_TIM1EN
#  define STM32_RCC_TIM1_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM1_RST     RCC_APB2RSTR_TIM1RST
#  define STM32_RCC_TIM2_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM2_EN      RCC_APB1ENR_TIM2EN
#  define STM32_RCC_TIM2_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM2_RST     RCC_APB1RSTR_TIM2RST
#  define STM32_RCC_TIM3_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM3_EN      RCC_APB1ENR_TIM3EN
#  define STM32_RCC_TIM3_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM3_RST     RCC_APB1RSTR_TIM3RST
#  define STM32_RCC_TIM4_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM4_EN      RCC_APB1ENR_TIM4EN
#  define STM32_RCC_TIM4_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM4_RST     RCC_APB1RSTR_TIM4RST
#  define STM32_RCC_TIM5_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM5_EN      RCC_APB1ENR_TIM5EN
#  define STM32_RCC_TIM5_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM5_RST     RCC_APB1RSTR_TIM5RST
#  define STM32_RCC_TIM6_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM6_EN      RCC_APB1ENR_TIM6EN
#  define STM32_RCC_TIM6_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM6_RST     RCC_APB1RSTR_TIM6RST
#  define STM32_RCC_TIM7_EN_REG  STM32_RCC_APB1ENR
#  define STM32_RCC_TIM7_EN      RCC_APB1ENR_TIM7EN
#  define STM32_RCC_TIM7_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM7_RST     RCC_APB1RSTR_TIM7RST
#  define STM32_RCC_TIM8_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM8_EN      RCC_APB2ENR_TIM8EN
#  define STM32_RCC_TIM8_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM8_RST     RCC_APB2RSTR_TIM8RST
#  define STM32_RCC_TIM9_EN_REG  STM32_RCC_APB2ENR
#  define STM32_RCC_TIM9_EN      RCC_APB2ENR_TIM9EN
#  define STM32_RCC_TIM9_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM9_RST     RCC_APB2RSTR_TIM9RST
#  define STM32_RCC_TIM10_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM10_EN     RCC_APB2ENR_TIM10EN
#  define STM32_RCC_TIM10_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM10_RST    RCC_APB2RSTR_TIM10RST
#  define STM32_RCC_TIM11_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM11_EN     RCC_APB2ENR_TIM11EN
#  define STM32_RCC_TIM11_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM11_RST    RCC_APB2RSTR_TIM11RST
#  define STM32_RCC_TIM12_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM12_EN     RCC_APB1ENR_TIM12EN
#  define STM32_RCC_TIM12_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM12_RST    RCC_APB1RSTR_TIM12RST
#  define STM32_RCC_TIM13_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM13_EN     RCC_APB1ENR_TIM13EN
#  define STM32_RCC_TIM13_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM13_RST    RCC_APB1RSTR_TIM13RST
#  define STM32_RCC_TIM14_EN_REG STM32_RCC_APB1ENR
#  define STM32_RCC_TIM14_EN     RCC_APB1ENR_TIM14EN
#  define STM32_RCC_TIM14_RST_REG STM32_RCC_APB1RSTR
#  define STM32_RCC_TIM14_RST    RCC_APB1RSTR_TIM14RST
#  define STM32_RCC_TIM15_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM15_EN     RCC_APB2ENR_TIM15EN
#  define STM32_RCC_TIM15_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM15_RST    RCC_APB2RSTR_TIM15RST
#  define STM32_RCC_TIM16_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM16_EN     RCC_APB2ENR_TIM16EN
#  define STM32_RCC_TIM16_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM16_RST    RCC_APB2RSTR_TIM16RST
#  define STM32_RCC_TIM17_EN_REG STM32_RCC_APB2ENR
#  define STM32_RCC_TIM17_EN     RCC_APB2ENR_TIM17EN
#  define STM32_RCC_TIM17_RST_REG STM32_RCC_APB2RSTR
#  define STM32_RCC_TIM17_RST    RCC_APB2RSTR_TIM17RST
#endif

#endif /* __ARCH_ARM_SRC_COMMON_STM32_STM32_TIM_CLK_H */
